In [3]:
import pandas as pd
import numpy as np

DataFrame.dropna(*, axis=0,
                 how=<no_default>,
                 thresh=<no_default>,
                 subset=None, 
                 inplace=False,
                 ignore_index=False)

In [4]:
df = pd.DataFrame({ 
                    "name": ['Alfred', 'Batman', 'Catwoman'],
                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),pd.NaT]
                  })

In [5]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Drop the rows where at least one element is missing.

In [6]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [8]:
df.dropna(axis=0,how='any')

     name        toy       born
1  Batman  Batmobile 1940-04-25

Drop the columns where at least one element is missing.

In [9]:
df.dropna(axis=1)

       name
0    Alfred
1    Batman
2  Catwoman

In [10]:
df.dropna(axis='columns')

       name
0    Alfred
1    Batman
2  Catwoman

In [11]:
df.dropna(axis=1,how='any')

       name
0    Alfred
1    Batman
2  Catwoman

Drop the rows where all elements are missing.

In [13]:
df.dropna(axis=0,how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Drop the columns where all elements are missing.

In [15]:
df.dropna(axis=1,how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [19]:
# insert a column of all null values
df.insert(3,'not_av',[np.nan,np.nan,np.nan])

In [17]:
df

       name        toy       born  not_av
0    Alfred        NaN        NaT     NaN
1    Batman  Batmobile 1940-04-25     NaN
2  Catwoman   Bullwhip        NaT     NaN

In [20]:
df.dropna(axis=1,how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Define in which columns to look for missing values.

In [22]:
df

       name        toy       born  not_av
0    Alfred        NaN        NaT     NaN
1    Batman  Batmobile 1940-04-25     NaN
2  Catwoman   Bullwhip        NaT     NaN

In [32]:
df.dropna(subset=['toy','born'],axis=0,how='all')

       name        toy       born  not_av
1    Batman  Batmobile 1940-04-25     NaN
2  Catwoman   Bullwhip        NaT     NaN

Keep only the rows with at least 2 non-NA values.

In [40]:
df.dropna(thresh=2)

       name        toy       born  not_av
1    Batman  Batmobile 1940-04-25     NaN
2  Catwoman   Bullwhip        NaT     NaN

Keep only the columns with at least 3 non-NA values.

In [44]:
df.dropna(thresh=3,axis=1)

       name
0    Alfred
1    Batman
2  Catwoman